{
    "exam_name": "ക്ലാർക്ക് (LDC) ",
    "total_marks": 100,
    "subjects": [
        {
            "name": "ചരിത്രം",
            "marks": 5,
            "topics": [
                "കേരളം: യൂറോപ്യൻമാരുടെ വരവ് - യൂറോപ്യൻമാരുടെ സംഭാവന - മാർത്താണ്ഡവർമ്മ മുതൽ ശ്രീചിത്തിരതിരുനാൾ വരെ - തിരുവിതാംകൂറിൻ്റെ ചരിത്രം - സാമൂഹ്യ, മത, നവോത്ഥാന പ്രസ്ഥാനങ്ങൾ - കേരളത്തിലെ ദേശീയ പ്രസ്ഥാനങ്ങൾ - കേരള ചരിത്രത്തിൻ്റെ സാഹിത്യ സ്രോതസ്സുകൾ - ഐക്യകേരള പ്രസ്ഥാനം - 1956-നു ശേഷമുള്ള കേരളത്തിൻ്റെ സാമൂഹ്യരാഷ്ട്രീയ ചരിത്രം.",
                "ഇന്ത്യ : രാഷ്ട്രീയ ചരിത്രം - ബ്രിട്ടീഷ് ആധിപത്യം - ഒന്നാം സ്വാതന്ത്ര്യസമരം - ഇന്ത്യൻ നാഷണൽ കോൺഗ്രസിൻ്റെ രൂപീകരണം - സ്വദേശി പ്രസ്ഥാനം - സാമൂഹ്യപരിഷ്കരണ പ്രസ്ഥാനങ്ങൾ - സ്വാതന്ത്ര്യസമരചരിത്രകാലത്തെ വർത്തമാനപത്രങ്ങൾ - സാഹിത്യവും കലയും - സ്വാതന്ത്ര്യ സമരവും മഹാത്മാഗാന്ധിയും - ഇന്ത്യയുടെ സ്വാതന്ത്ര്യാനന്തര കാലഘട്ടം - സംസ്ഥനങ്ങളുടെ പുനഃസംഘടന - ശാസ്ത്ര വിദ്യാഭ്യാസ സാങ്കേതിക മേഖലയിലെ പുരോഗതി - വിദേശ നയം.",
                "ലോകം : ഇംഗ്ലണ്ടിലെ മഹത്തായ വിപ്ലവം (Great Revolution) - അമേരിക്കൻ സ്വാതന്ത്ര്യ സമരം - ഫ്രഞ്ച് വിപ്ലവം - റഷ്യൻ വിപ്ലവം - ചൈനീസ് വിപ്ലവം - രണ്ടാം ലോക മഹായുദ്ധാനന്തര രാഷ്ട്രീയ ചരിത്രം - ഐക്യരാഷ്ട്രസംഘടന, മറ്റ് അന്താരാഷ്ട്ര സംഘടനകൾ"
            ]
        },
        {
            "name": "ഭൂമിശാസ്ത്രം",
            "marks": 5,
            "topics": [
                "ഭൂമിശാസ്ത്രത്തിന്റെ അടിസ്ഥാന തത്വങ്ങൾ - ഭൂമിയുടെ ഘടന - അന്തരീക്ഷം, പാറകൾ, ഭൗമോപരിതലം, അന്തരീക്ഷ മർദ്ദവും കാറ്റും, താപനിലയും ഋതുക്കളും, ആഗോളപ്രശ്നങ്ങൾ - ആഗോളതാപനം - വിവിധതരം മലിനീകരണങ്ങൾ, ഭൂപടങ്ങൾ - ഭൂപടങ്ങൾ, അടയാളങ്ങൾ, വിദൂരസംവേദനം - വിവരസംവിധാനം, ടോപ്പോഗ്രാഫിക് മാപ്പുകൾ, മഹാസമുദ്രങ്ങൾ, സമുദ്രചലനങ്ങൾ, ഭൂഖണ്ഡങ്ങൾ, ലോകരാഷ്ട്രങ്ങളും അവയുടെ സവിശേഷതകളും",
                "ഇന്ത്യ : ഭൂപ്രകൃതി - സംസ്ഥാനങ്ങൾ അവയുടെ സവിശേഷതകൾ - ഉത്തരപർവ്വത മേഖല, നദികൾ, ഉത്തരമഹാസമതലം, ഉപദ്വീപീയ പീഠഭൂമി, തീരദേശം, കാലാവസ്ഥ- സ്വാഭാവിക സസ്യപ്രകൃതി - കൃഷി - ധാതുക്കളും വ്യവസായവും - ഊർജ്ജസ്രോതസ്സുകൾ - റോഡ് -റെയിൽ -വ്യോമ ഗതാഗത സംവിധാനങ്ങൾ",
                "കേരളം : ഭൂപ്രകൃതി - ജില്ലകൾ, സവിശേഷതകൾ - നദികൾ - കാലാവസ്ഥ - സ്വാഭാവിക സസ്യപ്രകൃതി - വന്യജീവി - കൃഷിയും ധാതുക്കളും വ്യവസായവും - റോഡ് - ജല -റെയിൽ -വ്യോമ ഗതാഗത സംവിധാനങ്ങൾ - ഗവേഷണ സ്ഥാപനങ്ങളും ഊർജ്ജ സ്രോതസ്സുകൾ"
            ]
        },
        {
            "name": "ധനതത്വശാസ്ത്രം",
            "marks": 5,
            "topics": [
                "ഇന്ത്യ: സാമ്പത്തിക രംഗം, പഞ്ചവത്സര പദ്ധതികൾ, പ്ലാനിംഗ് കമ്മീഷൻ, നീതി ആയോഗ്, നവസാമ്പത്തിക പരിഷ്കാരങ്ങൾ, ധനകാര്യ സ്ഥാപനങ്ങൾ, കാർഷിക വിളകൾ, ധാതുക്കൾ, ഹരിത വിപ്ലവം."
            ]
        },
        {
            "name": "ഇന്ത്യൻ ഭരണഘടന",
            "marks": 5,
            "topics": [
                "ഭരണഘടന നിർമ്മാണ സമിതി, ആമുഖം, പൗരത്വം - മൗലികാവകാശങ്ങൾ - നിർദ്ദേശക തത്വങ്ങൾ - മൗലിക കടമകൾ, ഗവൺമെൻ്റിൻ്റെ ഘടകങ്ങൾ, പ്രധാനപ്പെട്ട ഭരണ ഘടനാ ഭേദഗതികൾ (42, 44, 52, 73, 74, 86, 91), പഞ്ചായത്തീരാജ്, ഭരണഘടനാ സ്ഥാപനങ്ങളും അവയുടെ ചുമതലകളും യൂണിയൻ ലിസ്റ്റ്- സ്റ്റേറ്റ് ലിസ്റ്റ്- കൺകറന്റ് ലിസ്റ്റ്."
            ]
        },
        {
            "name": "ആനുകാലിക വിഷയങ്ങൾ",
            "marks": 20,
            "topics": []
        },
        {
            "name": "ലഘു ഗണിതം",
            "marks": 5,
            "topics": [
                "സംഖ്യകളും അടിസ്ഥാന ക്രിയകളും (Numbers and Basic Operations)",
                "ഭിന്നസംഖ്യകളും ദശാംശ സംഖ്യകളും (Fraction and Decimal Numbers)",
                "ശതമാനം (Percentage)",
                "ലാഭവും നഷ്ടവും (Profit and Loss)",
                "സാധാരണ പലിശയും കൂട്ടുപലിശയും (Simple and Compound Interest)",
                "അംശബന്ധവും അനുപാതവും (Ratio and Proportion)",
                "സമയവും ദൂരവും (Time and Distance)",
                "സമയവും പ്രവർത്തിയും (Time and Work)",
                "ശരാശരി (Average)",
                "കൃത്യങ്കങ്ങൾ (Laws of Exponents)",
                "ജ്യാമിതീയ രൂപങ്ങളുടെ ചുറ്റളവ്, വിസ്തീർണ്ണം, വ്യാപ്തം തുടങ്ങിയവ (Mensuration)",
                "പ്രോഗ്രേഷനുകൾ (Progressions)"
            ]
        },
        {
            "name": "മാനസിക ശേഷിയും നിരീക്ഷണപാടവ പരിശോധനയും",
            "marks": 5,
            "topics": [
                "ശ്രേണികൾ - സംഖ്യാ ശ്രേണികൾ, അക്ഷര ശ്രേണികൾ (Series)",
                "ഗണിത ചിഹ്നങ്ങൾ ഉപയോഗിച്ചുള്ള പ്രശ്നങ്ങൾ (Problems on Mathematics Signs)",
                "സ്ഥാന നിർണ്ണയ പരിശോധന",
                "അനാലോജി (Analogy- Word Analogy, Alphabet Analogy, Number Analogy)",
                "ഒറ്റയാനെ കണ്ടെത്തുക (Odd man out)",
                "സംഖ്യാവലോകന പ്രശ്നങ്ങൾ",
                "കോഡിംഗും ഡീകോഡിംഗും (Coding and De Coding)",
                "കുടുംബ ബന്ധങ്ങൾ (Family Relations)",
                "ദിശാവബോധം ( Sense of Direction)",
                "ക്ലോക്കിലെ സമയവും കോണളവും (Time and Angles)",
                "ക്ലോക്കിലെ സമയവും പ്രതിബിംബവും (Time in a clock and its reflection)",
                "കലണ്ടറും തീയതിയും (Date and Calendar)",
                "ക്ലറിക്കൽ ശേഷി പരിശോധിക്കുന്ന തിനുള്ള ചോദ്യങ്ങൾ (Clerical Ability)"
            ]
        }
    ]
}
    

